org-mode.org
* what is org-mode ? 
  - It is a mode within emacs that started its life as an outliner .
  - org mode is usually used as a markup language to write notes ,to do lists , and much more. 
  - It is an example of an exocortex , which is something to rely on other than your brain to remember things.
* org-mode features
  - Easy outlining with =tab= folding to maximize focus on the task. 
  - Task management & to-do lists with different states
  - =t= to cycle through the different states of the list item.
*** To do lists must be headers 
**** DONE task uno
     CLOSED: [2018-08-19 Sun 14:57]
**** TODO 2nd task 
**** TODO 3rd  task
***  Progress indicators [2/3]
**** TODO barber
**** DONE walk dog
     CLOSED: [2018-08-19 Sun 15:04]
**** DONE launch
     CLOSED: [2018-08-19 Sun 15:04]
*** Percentage indicators [75%]
**** DONE wash car
     CLOSED: [2018-08-19 Sun 16:18]
**** DONE cook dinner
     CLOSED: [2018-08-19 Sun 15:07]
**** TODO run
**** DONE shower
     CLOSED: [2018-08-19 Sun 15:07]
 
* Markup 
*** Text Transformations
    - /italic/ text
    - *bold* text
    - =verbatim=
    - +stroke through+ text
*** Meta Data
    - Title
      #+TITLE: A Quick Introduction to Org-mode
      =#+TITLE: A Quick Introduction to Org-mode=
    - Options to [disable/enable] features.
      #+OPTIONS: num:nil toc:t
      =#+OPTIONS: num:nil toc:t=
      #+AUTHOR: Ryan Leulmi
      =#+AUTHOR: Ryan Leulmi=
*** Links =[[address][description]]=
    - C-c + C-l to create a link automatically
    - HTTP links
      [[https://github.com//ryanLeulmi][my github]]
    - Local Links to files / todos / files / etc..
      [[file:~/.spacemacs][dotspacemacs]]
    - C-c + C-o to open a local link in a new buffer
*** Source Code
    - =<s + tab= to create a code block
    - =C-c + '= to open a code block in a new buffer with it's mode
    - =C-c + C-c= to evaluate a code block with its compiler
    - LateX + Math integration
#+BEGIN_SRC bash
  export PATH="`yarn global bin`:$PATH"
#+END_SRC
*** Raw HTML export
#+BEGIN_SRC org
,#+BEGIN_EXPORT html
<h3> RAW HTML </h3>
,#+END_EXPORT
#+END_SRC
*** Smarter Tables
    - org mode tables are smart spread sheets
    | Student # | Email                | Password |
    |-----------+----------------------+----------|
    | ryan      | ryanleulmi@gmail.com | 1234     |
    | student   | another one          | asd21    |
* Export to other formats from the same source
  - C-c + C-e
  - twitter bootstrap =ox-twbs=
  - html , pdf , markdown =ox-gfm=
  - =org-export-backends= to manage your export backends.
  - =org-file-apps= to change which apps your export backends use.
* Literate programming
  - =C-c + C-c= to evaluate a code block with its compiler
  - Evaluate all the code blocks in an org file
