org-mode.html
<!doctype html>
<html lang="en">
<head>
<title>A Quick Introduction to Org-mode</title>
<!-- 2018-08-19 Sun 16:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Ryan Leulmi">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">A Quick Introduction to Org-mode</h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">what is org-mode ?</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>It is a mode within emacs that started its life as an outliner .
</li>
<li>org mode is usually used as a markup language to write notes ,to do lists , and much more. 
</li>
<li>It is an example of an exocortex , which is something to rely on other than your brain to remember things.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">org-mode features</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>Easy outlining with <code>tab</code> folding to maximize focus on the task. 
</li>
<li>Task management &amp; to-do lists with different states
</li>
<li><code>t</code> to cycle through the different states of the list item.
</li>
</ul>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">To do lists must be headers</h4>
<div class="outline-text-4" id="text-">
</div><ul class="org-ul"><li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> task uno<br ><div class="outline-text-5" id="text-">
</div>
</li>
<li><a id="sec-" name="sec-"></a><span class="label label-primary TODO">TODO</span> 2nd task<br ></li>
<li><a id="sec-" name="sec-"></a><span class="label label-primary TODO">TODO</span> 3rd  task<br ></li></ul>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Progress indicators <code>[2/3]</code></h4>
<div class="outline-text-4" id="text-">
</div><ul class="org-ul"><li><a id="sec-" name="sec-"></a><span class="label label-primary TODO">TODO</span> barber<br ></li>
<li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> walk dog<br ><div class="outline-text-5" id="text-">
</div>
</li>
<li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> launch<br ><div class="outline-text-5" id="text-">
</div>
</li></ul>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Percentage indicators <code>[75%]</code></h4>
<div class="outline-text-4" id="text-">
</div><ul class="org-ul"><li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> wash car<br ><div class="outline-text-5" id="text-">
</div>
</li>
<li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> cook dinner<br ><div class="outline-text-5" id="text-">
</div>
</li>
<li><a id="sec-" name="sec-"></a><span class="label label-primary TODO">TODO</span> run<br ></li>
<li><a id="sec-" name="sec-"></a><span class="label label-default DONE">DONE</span> shower<br ><div class="outline-text-5" id="text-">
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Markup</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Text Transformations</h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li><i>italic</i> text
</li>
<li><b>bold</b> text
</li>
<li><code>verbatim</code>
</li>
<li><del>stroke through</del> text
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Meta Data</h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li>Title
<p>
<code>#+TITLE: A Quick Introduction to Org-mode</code>
</p>
</li>
<li>Options [disable/enable] features
<p>
<code>#+OPTIONS: num:nil toc:t</code>
</p>
<p>
<code>#+AUTHOR: Ryan Leulmi</code>
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Links <code>[[address][description]]</code></h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li>C-c + C-l to create a link automatically
</li>
<li>HTTP links
<a href="https://github.com//ryanLeulmi">my github</a>
</li>
<li>Local Links to files / todos / files / etc..
<a href="file:///home/ryan/.spacemacs">dotspacemacs</a>
</li>
<li>C-c + C-o to open a local link in a new buffer
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Source Code</h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li><code>&lt;s + tab</code> to create a code block
</li>
<li><code>C-c + '</code> to open a code block in a new buffer with it's mode
</li>
<li><code>C-c + C-c</code> to evaluate a code block with its compiler
</li>
<li>LateX + Math integration
</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #ff0066;">export</span> <span style="color: #ffac4a;">PATH</span>=<span style="color: #E6DB74;">"`yarn global bin`:$PATH"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Raw HTML export</h4>
<div class="outline-text-4" id="text-">
<div class="org-src-container">

<pre class="src src-org"><span style="color: #6A6D70; font-style: italic;">#+BEGIN_EXPORT html</span>
<span style="color: #6A6D70;">&lt;</span><span style="color: #63de5d;">h3</span><span style="color: #6A6D70;">&gt;</span><span style="color: #6A6D70; text-decoration: underline;"> RAW HTML </span><span style="color: #6A6D70;">&lt;/</span><span style="color: #63de5d;">h3</span><span style="color: #6A6D70;">&gt;</span>
<span style="color: #6A6D70; font-style: italic;">#+END_EXPORT</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">Smarter Tables</h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li>org mode tables are smart spread sheets
</li>
</ul>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Student #</th>
<th scope="col" class="text-left">Email</th>
<th scope="col" class="text-left">Password</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">ryan</td>
<td class="text-left">ryanleulmi@gmail.com</td>
<td class="text-left">1234</td>
</tr>

<tr>
<td class="text-left">student</td>
<td class="text-left">another one</td>
<td class="text-left">asd21</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Export to other formats from the same source</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>C-c + C-e
</li>
<li>twitter bootstrap <code>ox-twbs</code>
</li>
<li>html , pdf , markdown <code>ox-gfm</code>
</li>
<li><code>org-export-backends</code> to manage your export backends.
</li>
<li><code>org-file-apps</code> to change which apps your export backends use.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Literate programming</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li><code>C-c + C-c</code> to evaluate a code block with its compiler
</li>
<li>Evaluate all the code blocks in an org file
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">what is org-mode ?</a></li>
<li><a href="#sec-">org-mode features</a>
<ul class="nav">
<li>
<ul class="nav">
<li><a href="#sec-">To do lists must be headers</a></li>
<li><a href="#sec-">Progress indicators <code>[2/3]</code></a></li>
<li><a href="#sec-">Percentage indicators <code>[75%]</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-">Markup</a>
<ul class="nav">
<li>
<ul class="nav">
<li><a href="#sec-">Text Transformations</a></li>
<li><a href="#sec-">Meta Data</a></li>
<li><a href="#sec-">Links <code>[[address][description]]</code></a></li>
<li><a href="#sec-">Source Code</a></li>
<li><a href="#sec-">Raw HTML export</a></li>
<li><a href="#sec-">Smarter Tables</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-">Export to other formats from the same source</a></li>
<li><a href="#sec-">Literate programming</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Ryan Leulmi</p>
<p class="date">Created: 2018-08-19 Sun 16:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org-mode</a> 9.1.13)</p>
</div>
</footer>
</body>
</html>
